case/j20_inner_buoP-0214/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     buoyantPimpleFoam;

//startFrom       startTime;
startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         3600;

//deltaT          0.01;
//deltaT          0.1;     //0.6-->282.6
deltaT          0.5;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           1;
maxDeltaT       1; // 避免时间步长过大


functions
{
    // htc
    // {
    //     type            heatTransferCoeff;
    //     libs            (fieldFunctionObjects);
    //     field           T;
    //     writeControl    writeTime;
    //     writeInterval   1;
    //     htcModel        fixedReferenceTemperature;
    //     patches         (ceiling);
    //     TRef            373;
    // }


    // residuals
    // {
    //     type residuals;
    //     libs ("libpostProcessors.so");
    //     fields (p U k epsilon); // 指定需要记录残差的场变量
    //     log true; // 将残差信息输出到日志文件
    // }

}


// ************************************************************************* //
